000100200615             PGM
000101200615             CALL       PGM(QGPL/STRJOB)
000102200615             ADDLIBLE   BCI433LIB
000103200617             MONMSG     MSGID(CPF2103)
000105200615             DSPSYSLVL  OUTPUT(*DISPLAY)
000106200615             ENDPGM
000107200615
000108200615
