000100200607       dcl-f INCOMETDSP WORKSTN;
000101200607       EXFMT GETINCOME;
000102200607       DOW NOT(*IN03);
000103200607         IF INCOMEAMT = 0;
000104200607           *IN98 = *ON;
000105200607           EXFMT GETINCOME;
000106200607           *IN98 = *OFF;
000107200607           ITER;
000108200607         ELSEIF MARRIED = '';
000109200607           *IN97 = *ON;
000110200607           EXFMT GETINCOME;
000111200607           *IN97 = *OFF;
000112200607           ITER;
000113200607         ELSE;
000114200607           DEDUCTIONS = STDEXPENSE + DONATIONS;
000115200607           AINCOMEAMT = INCOMEAMT - DEDUCTIONS;
000116200607           EXSR GETTAXRATE;
000117200607         ENDIF;
000118200607
000119200607         DAYSTOPAY = %DIFF(%DATE():D'2020-06-07':*DAYS);
000120200607         TAXAMT = AINCOMEAMT * TAXRATE;
000121200607
000122200607         *IN60 = *ON;
000123200607         WRITE GETINCOME;
000124200607         EXFMT YOURTAX;
000125200607         *IN60 = *OFF;
000126200607
000127200607         IF *IN03 = *OFF;
000128200607           EXSR CLEAR;
000129200607           EXFMT GETINCOME;
000130200607         ENDIF;
000131200607
000132200607       ENDDO;
000133200607       *INLR = *ON;
000134200607       RETURN;
000135200607       BEGSR GetTaxRate;
000136200607
000137200607       ENDSR;
000138200607       BEGSR CLEAR;
000139200607
000140200607       ENDSR;
000141200607
