000100200607       dcl-f INCOMETDSP WORKSTN;
000101200607       EXFMT GETINCOME;
000102200607       DOW NOT(*IN03);
000103200607         IF INCOMEAMT = 0;
000104200607           *IN98 = *ON;
000105200607           EXFMT GETINCOME;
000106200607           *IN98 = *OFF;
000107200607           ITER;
000108200607         ELSEIF MARRIED = '';
000109200607           *IN97 = *ON;
000110200607           EXFMT GETINCOME;
000111200607           *IN97 = *OFF;
000112200607           ITER;
000113200607         ELSE;
000114200610           IF DONATIONS > 10000;
000115200610             DONATIONS = 10000;
000116200610           ENDIF;
000117200610           IF STDEXPENSE > 4000;
000118200610             STDEXPENSE = 4000;
000119200610           ENDIF;
000120200607           DEDUCTIONS = STDEXPENSE + DONATIONS;
000121200607           AINCOMEAMT = INCOMEAMT - DEDUCTIONS;
000122200607           EXSR GETTAXRATE;
000123200607         ENDIF;
000124200607
000125200611         DAYSTOPAY = %DIFF(%DATE():D'2020-01-12':*DAYS);
000126200611         TAXAMT = AINCOMEAMT * (TAXRATE / 100);
000127200607
000128200607         *IN60 = *ON;
000129200607         WRITE GETINCOME;
000130200607         EXFMT YOURTAX;
000131200607         *IN60 = *OFF;
000132200607
000133200607         IF *IN03 = *OFF;
000134200607           EXSR CLEAR;
000135200607           EXFMT GETINCOME;
000136200607         ENDIF;
000137200607
000138200607       ENDDO;
000139200607       *INLR = *ON;
000140200607       RETURN;
000141200607       BEGSR GetTaxRate;
000142200610         IF MARRIED = 'Y';
000143200610         SELECT;
000144200610           WHEN AINCOMEAMT < 1951;
000145200611             TAXRATE = 10;
000146200610             WHEN AINCOMEAMT < 77401;
000147200611               TAXRATE = 12;
000148200610               WHEN AINCOMEAMT < 165001;
000149200611                 TAXRATE = 22;
000150200610                 WHEN AINCOMEAMT < 315001;
000151200611                   TAXRATE = 24;
000152200610                   WHEN AINCOMEAMT < 400001;
000153200611                     TAXRATE = 32;
000154200610                     WHEN AINCOMEAMT < 600001;
000155200611                       TAXRATE = 35;
000156200610                       OTHER;
000157200611                         TAXRATE = 37;
000158200610                         ENDSL;
000159200610         ELSE;
000160200610           MARRIED = 'N';
000161200610           SELECT;
000162200610             WHEN AINCOMEAMT < 9526;
000163200611               TAXRATE = 10;
000164200611               WHEN AINCOMEAMT < 38701;
000165200611                 TAXRATE = 12;
000166200610                 WHEN AINCOMEAMT < 82501;
000167200611                   TAXRATE = 22;
000168200610                   WHEN AINCOMEAMT < 157501;
000169200611                     TAXRATE = 24;
000170200610                     WHEN AINCOMEAMT < 200001;
000171200611                       TAXRATE = 32;
000172200610                       WHEN AINCOMEAMT < 500001;
000173200611                         TAXRATE = 35;
000174200610                         OTHER;
000175200611                           TAXRATE = 37;
000176200610                           ENDSL;
000177200610         ENDIF;
000178200607       ENDSR;
000179200607       BEGSR CLEAR;
000180200610         INCOMEAMT = 0;
000181200610         MARRIED = '';
000182200610         DEDUCTIONS = 0;
000183200610         DONATIONS = 0;
000184200610         STDEXPENSE = 0;
000185200610         AINCOMEAMT = 0;
000186200607       ENDSR;
000187200607
